# List needed taps
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# Utilities
brew "fzf"
brew "git"
brew "mackup"
brew "thefuck"
brew "yarn", args: ["without-node"]
brew "zsh"
brew "antigen"
brew "qt"

# Apps
cask "google-chrome"
cask "firefox"
cask "vs-code"
cask "item2"
cask "dropbox"
cask "google-backup-and-sync"
cask "1password"
cask "cloudapp"
cask "fantastical"
cask "alfred"
cask "keyboard-maestro"
cask "the-unarchiver"
cask "whatsapp"
cask "slack"
cask "bettertouchtool"
cask "vlc"
cask "transmission"


# Fonts
cask "font-fira-mono-for-powerline"
cask "font-fira-code"
cask "font-source-code-pro-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
